RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rtc.c
/*!
 * @file        apm32f4xx_rtc.c
 *
 * @brief       This file provides all the RTC firmware functions
 *
 * @version     V1.0.2
 *
 * @date        2022-06-23
 *
 * @attention
 *
 *  Copyright (C) 2021-2022 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32f4xx.h"
#include "apm32f4xx_rtc.h"
#include "apm32f4xx_rcm.h"

/** @addtogroup APM32F4xx_StdPeriphDriver
  @{
*/

/** @defgroup RTC_Driver
  * @brief RTC driver modules
  @{
*/

/** @defgroup RTC_Macros Macros
  @{
*/

/* RTC timeout definition */
#define RTC_TIMEOUT_WAKE_UP        ((uint32_t)0x00010000)
#define RTC_TIMEOUT_INIT           ((uint32_t)0x00010000)
#define RTC_TIMEOUT_ALARM          ((uint32_t)0x00010000)
#define RTC_TIMEOUT_CALIB          ((uint32_t)0x00020000)
#define RTC_TIMEOUT_SYNCHRO        ((uint32_t)0x00020000)
#define RTC_TIMEOUT_SHIFT          ((uint32_t)0x00001000)

/**@} end of group RTC_Macros*/

/** @defgroup RTC_Functions
  @{
*/

static uint8_t RTC_ByteConBcd2(uint8_t val);
static uint8_t RTC_Bcd2ConByte(uint8_t val);

/*!
 * @brief     Reset the RTC registers to their default values.
 *
 * @param     None
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_Reset(void)
{
    __IO uint32_t timeout = 0x00;

    RTC_DisableWriteProtection();

    if (RTC_EnableInit() == ERROR)
    {
        RTC_EnableWriteProtection();

        return ERROR;
    }
    else
    {
        /* Reset register */
        RTC->TIME  = (uint32_t)0x00000000;
        RTC->DATE  = (uint32_t)0x00002101;
        RTC->CTRL &= (uint32_t)0x00000007;

        /* Wait for wakeup timer write flag */
        while ((RTC->STS_B.WUTWFLG != BIT_SET) && (timeout != RTC_TIMEOUT_WAKE_UP))
        {
            timeout++;
        }

        if (RTC->STS_B.WUTWFLG == BIT_RESET)
        {
            RTC_EnableWriteProtection();

            return ERROR;
        }
        else
        {
            /* Reset register */
            RTC->CTRL = (uint32_t)0x00000000;
            RTC->AUTORLD = (uint32_t)0x0000FFFF;
            RTC->PSC = (uint32_t)0x007F00FF;
            RTC->DCAL = (uint32_t)0x00000000;
            RTC->ALRMA = (uint32_t)0x00000000;
            RTC->ALRMB = (uint32_t)0x00000000;
            RTC->SHIFT = (uint32_t)0x00000000;
            RTC->CAL = (uint32_t)0x00000000;
            RTC->ALRMASS = (uint32_t)0x00000000;
            RTC->ALRMBSS = (uint32_t)0x00000000;

            RTC->STS = (uint32_t)0x00000000;

            RTC->TACFG = (uint32_t)0x00000000;

            if (RTC_WaitForSynchro() == ERROR)
            {
                RTC_EnableWriteProtection();

                return ERROR;
            }
            else
            {
                RTC_EnableWriteProtection();

                return SUCCESS;
            }
        }
    }
}

/*!
 * @brief     Deinitializes the RTC registers to their default reset values
 *
 * @param     rtcConfig : pointer to a RTC_Config_T structure which will be initialized
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_Config(RTC_Config_T *rtcConfig)
{
    RTC_DisableWriteProtection();

    if (RTC_EnableInit() == ERROR)
    {
        RTC_EnableWriteProtection();

        return ERROR;
    }
    else
    {
        RTC->CTRL_B.TIMEFCFG  = (rtcConfig->format);
        RTC->PSC_B.SPSC = (rtcConfig->synchPrediv);
        RTC->PSC_B.APSC = (rtcConfig->asynchPrediv);

        RTC_DisableInit();
        RTC_EnableWriteProtection();

        return SUCCESS;
    }
}

/*!
 * @brief     Fills each RTC_ConfigStruct member with its default value
 *
 * @param     rtcConfig : pointer to a RTC_Config_T structure which will be initialized
 *
 * @retval    None
 */
void RTC_ConfigStructInit(RTC_Config_T *rtcConfig)
{
    rtcConfig->format = RTC_HOURFORMAT_24;
    rtcConfig->asynchPrediv = (uint32_t)0x7F;
    rtcConfig->synchPrediv = (uint32_t)0xFF;
}

/*!
 * @brief     Enable the write protection for RTC registers
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_EnableWriteProtection(void)
{
    RTC->WRPROT = 0xFF;
}

/*!
 * @brief     Disable the write protection for RTC registers
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_DisableWriteProtection(void)
{
    RTC->WRPROT = 0xCA;
    RTC->WRPROT = 0x53;
}

/*!
 * @brief     Enable the RTC Initialization mode.
 *
 * @param     None
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_EnableInit(void)
{
    __IO uint32_t timeout = 0x00;

    if (RTC->STS_B.RINITFLG == BIT_RESET)
    {
        /* Enable initialization mode */
        RTC->STS_B.INITEN = BIT_SET;

        /* Wait for initialization flag */
        while ((RTC->STS_B.RINITFLG != BIT_SET) && (timeout != RTC_TIMEOUT_INIT))
        {
            timeout++;
        }

        if (RTC->STS_B.RINITFLG != BIT_SET)
        {
            return ERROR;
        }
    }

    return SUCCESS;
}

/*!
 * @brief     Disable the RTC Initialization mode.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_DisableInit(void)
{
    RTC->STS_B.INITEN = BIT_RESET;
}

/*!
 * @brief     Waits until the RTC Time and Date registers are synchronized
 *            with RTC APB clock
 *
 * @param     None
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_WaitForSynchro(void)
{
    __IO uint32_t timeout = 0;

    RTC_DisableWriteProtection();

    RTC->STS &= (uint32_t)0xFFFFFF5F;

    /* Wait for synchrocnt flag */
    while ((RTC->STS_B.RSFLG != BIT_SET) && (timeout != RTC_TIMEOUT_SYNCHRO))
    {
        timeout++;
    }

    if (RTC->STS_B.RSFLG != BIT_RESET)
    {
        RTC_EnableWriteProtection();

        return SUCCESS;
    }
    else
    {
        RTC_EnableWriteProtection();

