RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rtc.c
        return ERROR;
    }
}

/*!
 * @brief     Enables the RTC reference clock detection.
 *
 * @param     None
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_EnableRefClock(void)
{
    RTC_DisableWriteProtection();

    if (RTC_EnableInit() == ERROR)
    {
        RTC_EnableWriteProtection();

        return ERROR;
    }
    else
    {
        RTC->CTRL_B.RCLKDEN = BIT_SET;
        RTC_DisableInit();
        RTC_EnableWriteProtection();

        return SUCCESS;
    }
}

/*!
 * @brief     Disable the RTC reference clock detection
 *
 * @param     None
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_DisableRefClock(void)
{
    RTC_DisableWriteProtection();

    if (RTC_EnableInit() == ERROR)
    {
        RTC_EnableWriteProtection();

        return ERROR;
    }
    else
    {
        RTC->CTRL_B.RCLKDEN = BIT_RESET;
        RTC_DisableInit();
        RTC_EnableWriteProtection();

        return SUCCESS;
    }
}

/*!
 * @brief     Enable the Bypass Shadow feature.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_EnableBypassShadow(void)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.RCMCFG = BIT_SET;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Disable the Bypass Shadow feature.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_DisableBypassShadow(void)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.RCMCFG = BIT_RESET;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Config the RTC current time
 *
 * @param     format: specifies the format to write
 *                    This parameter can be one of the following values:
 *                    @arg RTC_FORMAT_BIN : Format in Bin
 *                    @arg RTC_FORMAT_BCD : Format in BCD
 *
 * @param     timeConfig: Pointer to a RTC_TimeConfig_T structure that
 *                        contains the configuration information for the RTC peripheral
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_ConfigTime(RTC_FORMAT_T format, RTC_TimeConfig_T *timeConfig)
{
    uint8_t state = ERROR;
    uint32_t temp = 0;

    if (RTC->CTRL_B.TIMEFCFG == BIT_RESET)
    {
        timeConfig->h12 = RTC_H12_AM;
    }

    /* Combine parameters of time */
    if (format != RTC_FORMAT_BIN)
    {
        temp = (((uint32_t)(timeConfig->hours) << 16) | \
                ((uint32_t)(timeConfig->minutes) << 8) | \
                ((uint32_t)(timeConfig->seconds)) | \
                ((uint32_t)(timeConfig->h12) << 22));
    }
    else
    {
        temp = (uint32_t)(((uint32_t)RTC_ByteConBcd2(timeConfig->hours) << 16) | \
                          ((uint32_t)RTC_ByteConBcd2(timeConfig->minutes) << 8) | \
                          ((uint32_t)RTC_ByteConBcd2(timeConfig->seconds)) | \
                          (((uint32_t)(timeConfig->h12) << 22)));
    }

    RTC_DisableWriteProtection();

    if (RTC_EnableInit() == ERROR)
    {
        state = ERROR;
    }
    else
    {
        RTC->TIME = (uint32_t)(temp & 0x007F7F7F);

        RTC_DisableInit();

        if (RTC->CTRL_B.RCMCFG == RESET)
        {
            if (RTC_WaitForSynchro() == ERROR)
            {
                state = ERROR;
            }
            else
            {
                state = SUCCESS;
            }
        }
        else
        {
            state = SUCCESS;
        }
    }

    RTC_EnableWriteProtection();

    return state;
}

/*!
 * @brief     Fills each timeConfig member with its default value
 *
 * @param     timeConfig:  Pointer to a RTC_TimeConfig_T structure that
 *                         contains the configuration information for the RTC peripheral
 *
 * @retval    None
 */
void RTC_ConfigTimeStructInit(RTC_TimeConfig_T *timeConfig)
{
    timeConfig->hours = 0;
    timeConfig->minutes = 0;
    timeConfig->seconds = 0;
    timeConfig->h12 = RTC_H12_AM;
}

/*!
 * @brief     Read the RTC current Time
 *
 * @param     format: specifies the format to write
 *                    This parameter can be one of the following values:
 *                    @arg RTC_FORMAT_BIN : format in Bin
 *                    @arg RTC_FORMAT_BCD : format in BCD
 *
 * @param     time:  Pointer to a RTC_TimeConfig_T structure that
 *                   contains the configuration information for the RTC peripheral
 *
 * @retval    None
 */
void RTC_ReadTime(RTC_FORMAT_T format, RTC_TimeConfig_T *time)
{
    uint32_t temp = 0;

    temp = (uint32_t)((RTC->TIME) & 0x007F7F7F);

    time->h12 = (RTC_H12_T)((temp & 0x00400000) >> 22);
    time->hours   = (uint8_t)((temp & 0x003F0000) >> 16);
    time->minutes = (uint8_t)((temp & 0x00007F00) >> 8);
    time->seconds = (uint8_t)(temp & 0x0000007F);

    if (format == RTC_FORMAT_BIN)
    {
        time->hours   = (uint8_t)RTC_Bcd2ConByte(time->hours);
        time->minutes = (uint8_t)RTC_Bcd2ConByte(time->minutes);
        time->seconds = (uint8_t)RTC_Bcd2ConByte(time->seconds);
    }
}

/*!
 * @brief     Read the RTC current Calendar Subseconds value
 *
 * @param     None
 *
 * @retval    RTC current Calendar Subseconds value
 */
uint32_t RTC_ReadSubSecond(void)
{
    uint32_t temp = 0;

    temp = (uint32_t)(RTC->SUBSEC);
    (void)(RTC->DATE);

    return temp;
}

/*!
 * @brief     Config the RTC current time
 *
 * @param     format: specifies the format to write
 *                    This parameter can be one of the following values:
 *                    @arg RTC_FORMAT_BIN : format in Bin
 *                    @arg RTC_FORMAT_BCD : format in BCD
 *
 * @param     dateConfig:  Pointer to a RTC_DateConfig_T structure that
 *                         contains the configuration DATE information for the RTC peripheral
 *
 * @retval    None
 */
uint8_t RTC_ConfigDate(RTC_FORMAT_T format, RTC_DateConfig_T *dateConfig)
{
    uint8_t state = ERROR;
    uint32_t temp = 0;

    if ((format == RTC_FORMAT_BIN) && ((dateConfig->month & 0x10) == 0x10))
    {
        dateConfig->month = (RTC_MONTH_T)((dateConfig->month & (uint32_t)~(0x10)) + 0x0A);
    }

    if (format != RTC_FORMAT_BIN)
    {
        temp = (((uint32_t)(dateConfig->year) << 16) | \
                ((uint32_t)(dateConfig->month) << 8) | \
                ((uint32_t)(dateConfig->date)) | \
                ((uint32_t)(dateConfig->weekday) << 13));
    }
    else
    {
        temp = (((uint32_t)RTC_ByteConBcd2(dateConfig->year) << 16) | \
                ((uint32_t)RTC_ByteConBcd2(dateConfig->month) << 8) | \
                ((uint32_t)RTC_ByteConBcd2(dateConfig->date)) | \
                ((uint32_t)(dateConfig->weekday) << 13));
    }

