RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rtc.c
    if ((RTC->STS_B.WUTWFLG) == BIT_RESET)
    {
        RTC_EnableWriteProtection();
        return ERROR;
    }
    else
    {
        RTC_EnableWriteProtection();
        return SUCCESS;
    }
}

/*!
 * @brief     Adds or substract one hour from the current time
 *
 * @param     saving: specifies the DayLight Saving.
 *                 This parameter can be one of the following values:
 *                 @arg RTC_DLS_SUB_1H : Winter time change
 *                 @arg RTC_DLS_ADD_1H : Summer time change
 *
 * @param     bit: set the Backup Value.
 *                 This parameter can be one of the following values:
 *                 @arg RTC_BACKUP_RESET : Reset backup value
 *                 @arg RTC_BACKUP_SET   : Set backup value
 *
 * @retval    None
 */
void RTC_ConfigDayLightSaving(RTC_DLS_T saving, RTC_BACKUP_T bit)
{
    RTC_DisableWriteProtection();

    if (saving == RTC_DLS_ADD_1H)
    {
        RTC->CTRL_B.STCCFG = BIT_SET;
    }
    else
    {
        RTC->CTRL_B.WTCCFG = BIT_SET;
    }

    /* Backup Value Setup */
    RTC->CTRL_B.BAKP = bit;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Returns the RTC Day Light Saving stored operation
 *
 * @param     None
 *
 * @retval    RTC Day Light Saving backup stored operation
 */
uint8_t RTC_ReadStoreOperation(void)
{
    return (uint8_t)RTC->CTRL_B.BAKP;
}

/*!
 * @brief     Config the RTC alarm Output Way and output polarity.
 *
 * @param     outputSel: specifies RTC alarm Output Way.
 *                       This parameter can be one of the following values:
 *                       @arg RTC_OUT_SEL_DISABLE : Disable RTC output
 *                       @arg RTC_OUT_SEL_ALARM_A : Select alarm A as RTC output
 *                       @arg RTC_OUT_SEL_ALARM_B : Select alarm B as RTC output
 *                       @arg RTC_OUT_SEL_WAKEUP: : Select wake up as RTC output
 *
 * @param     polarity: specified the output polarity.
 *                      This parameter can be one of the following values:
 *                      @arg RTC_OUT_POLARITY_HIGH : The output polarity is high
 *                      @arg RTC_OUT_POLARITY_LOW  : The output polarity is low
 *
 * @retval    None
 */
void RTC_ConfigOutput(RTC_OUT_SEL_T outputSel, RTC_OUT_POLARITY_T polarity)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.OUTSEL = outputSel;
    RTC->CTRL_B.POLCFG = polarity;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Config RTC Coarse calibration.
 *
 * @param     calibSign: specifies the sign of the coarse calibration value.
 *                       This parameter can be  one of the following values:
 *                       @arg RTC_CALIB_SIGN_POSITIVE : The Calibration sign is positive
 *                       @arg RTC_CALIB_SIGN_NEGATIVE : The Calibration sign is negative
 *
 * @param     value: a 5-bit value of coarse calibration expressed in ppm.
 *
 * @note      For positive sign, the Calibration value could be between 0 and 126
 *            with a 4-ppm step.
 *
 * @note      For negative sign, the Calibration value could be between 0 and 63
 *            with a 2-ppm step.
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_ConfigCoarseCalib(RTC_CALIB_SIGN_T calibSign, uint32_t value)
{
    RTC_DisableWriteProtection();

    if (RTC_EnableInit() == ERROR)
    {
        RTC_EnableWriteProtection();
        return ERROR;
    }
    else
    {
        RTC->DCAL_B.DCALCFG = calibSign;
        RTC->DCAL_B.DCAL    = value;

        RTC_DisableInit();
        RTC_EnableWriteProtection();

        return SUCCESS;
    }
}

/*!
 * @brief     Enables the Coarse calibration.
 *
 * @param     None
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_EnableCoarseCalib(void)
{
    RTC_DisableWriteProtection();

    if (RTC_EnableInit() == ERROR)
    {
        RTC_EnableWriteProtection();

        return ERROR;
    }
    else
    {
        RTC->CTRL_B.DCALEN = BIT_SET;

        RTC_DisableInit();
        RTC_EnableWriteProtection();

        return SUCCESS;
    }
}

/*!
 * @brief     Disables the Coarse calibration.
 *
 * @param     None
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_DisableCoarseCalib(void)
{
    RTC_DisableWriteProtection();

    if (RTC_EnableInit() == ERROR)
    {
        RTC_EnableWriteProtection();

        return ERROR;
    }
    else
    {
        RTC->CTRL_B.DCALEN = BIT_RESET;

        RTC_DisableInit();
        RTC_EnableWriteProtection();

        return SUCCESS;
    }
}

/*!
 * @brief     Enable the RTC clock Calibration Output.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_EnableCalibOutput(void)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.CALOEN = BIT_SET;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Disable the RTC clock Calibration Output.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_DisableCalibOutput(void)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.CALOEN = BIT_RESET;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Config the Calibration output.
 *
 * @param     calib: Select the Calibration output.
 *                   This parameter can be one of the following values:
 *                   @arg RTC_CALIB_OUTPUT_512HZ : Calibration output is 512 Hz
 *                   @arg RTC_CALIB_OUTPUT_1HZ   : Calibration output is 1 Hz
 *
 * @retval    None
 */
void RTC_ConfigCalibOutput(RTC_CALIB_OUTPUT_T calib)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.CALOSEL = calib;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Config the Synchronization Shift Control Settings.
 *
 * @param     period: Select the Smooth Calibration period.
 *                    This parameter can be can be one of the following values:
 *                    @arg RTC_SCP_32SEC : The smooth calibration periode is 32s.
 *                    @arg RTC_SCP_16SEC : The smooth calibration periode is 16s.
 *                    @arg RTC_SCP_8SEC  : The smooth calibartion periode is 8s.
 *
 * @param     calibPulse: Select to Set or reset the CALP bit.
 *                        This parameter can be one of the following values:
 *                        @arg RTC_SCPP_RESET : Add one RTCCLK puls every 2**11 pulses.
 *                        @arg RTC_SCPP_SET   : No RTCCLK pulses are added.
 *
 * @param     value: a 9-bits value to Config RECALF[8:0].
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_ConfigSmoothCalib(RTC_SCP_T period, RTC_SCPP_T calibPulse, uint16_t value)
{
    uint8_t state = ERROR;
    uint32_t timeout = 0;

