RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rtc.c
    RTC_DisableWriteProtection();

    /* wait for Recalibration flag to be cleared */
    while ((RTC->STS_B.RCALPFLG != BIT_RESET) && (timeout != RTC_TIMEOUT_CALIB))
    {
        timeout++;
    }

    if (RTC->STS_B.RCALPFLG != BIT_SET)
    {
        RTC->CAL = ((uint32_t)calibPulse << 15) | ((uint32_t)period << 13) |
                   (uint32_t)(value & 0x01FF);

        state = SUCCESS;
    }
    else
    {
        state = ERROR;
    }

    RTC_EnableWriteProtection();

    return state;
}

/*!
 * @brief     Enables the RTC TimeStamp functionality and config the Timestamp event
 *            active edge.
 *
 * @param     edge: Specifies the Timestamp event active edge.
 *                  This paramete can be one of the following:
 *                  @arg RTC_TIMESTAMP_EDGE_RISING  : Rising edge generates a timestamp event.
 *                  @arg RTC_TIMESTAMP_EDGE_FALLING : Falling edge generates a timestamp event
 *
 * @retval    None
 */
void RTC_EnableTimeStamp(RTC_TIMESTAMP_EDGE_T edge)
{
    RTC_DisableWriteProtection();

    /* Disable Timestamp when change the edge */
    RTC->CTRL_B.TSEN = BIT_RESET;

    RTC->CTRL_B.TSETECFG = edge;
    RTC->CTRL_B.TSEN = BIT_SET;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Disables the RTC TimeStamp functionality.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_DisableTimeStamp(void)
{
    RTC_DisableWriteProtection();

    RTC->CTRL_B.TSEN = BIT_RESET;

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Read the RTC TimeStamp value and masks
 *
 * @param     format: specifies the format of the output parameters.
 *                    This parameter can be one of the following values:
 *                    @arg RTC_FORMAT_BIN : data in Binary format
 *                    @arg RTC_FORMAT_BCD : data in BCD format
 *
 * @param     time: pointer to a RTC_TimeConfig_T structure that will
 *                  contains the TimeStamp time values.
 *
 * @param     date: pointer to a RTC_DateConfig_T structure that will
 *                  contains the TimeStamp date values.
 *
 * @retval    None
 */
void RTC_ReadTimeDate(RTC_FORMAT_T format, RTC_TimeConfig_T *time, RTC_DateConfig_T *date)
{
    uint32_t temptime = 0, tempdate = 0;
    temptime = (uint32_t)((RTC->TSTIME) & 0x007F7F7F);
    tempdate = (uint32_t)((RTC->TSDATE) & 0x00FFFF3F);

    /* Read the time in BCD format */
    time->hours   = (uint8_t)((temptime & 0x003F0000) >> 16);
    time->minutes = (uint8_t)((temptime & 0x00007F00) >> 8);
    time->seconds = (uint8_t)(temptime &  0x0000007F);
    time->h12 = (RTC_H12_T)((temptime & 0x00400000) >> 22);

    /* Read the date in BCD format */
    date->year  =  0;
    date->month = (RTC_MONTH_T)((tempdate & 0x00001F00) >> 8);
    date->date  = (uint8_t)(tempdate &  0x0000003F);
    date->weekday = (RTC_WEEKDAY_T)((tempdate & 0x0000E000) >> 13);

    /* Binary format */
    if (format == RTC_FORMAT_BIN)
    {
        time->hours   = (uint8_t)RTC_Bcd2ConByte(time->hours);
        time->minutes = (uint8_t)RTC_Bcd2ConByte(time->minutes);
        time->seconds = (uint8_t)RTC_Bcd2ConByte(time->seconds);

        date->month = (RTC_MONTH_T)RTC_Bcd2ConByte(date->month);
        date->date  = (uint8_t)RTC_Bcd2ConByte(date->date);
        date->weekday = (RTC_WEEKDAY_T)(date->weekday);
    }
}

/*!
 * @brief     Get the RTC timestamp Subseconds value
 *
 * @param     None
 *
 * @retval    RTC current timestamp Subseconds value
 */
uint16_t RTC_ReadTimeStampSubSecond(void)
{
    return RTC->TSSUBSEC_B.SUBSEC;
}

/*!
 * @brief     Config the select Tamper pin edge
 *
 * @param     tamper:  Selected tamper pin.
 *                     This parameter can be one of the following values:
 *                     @arg RTC_TAMPER_1 : Select Tamper 1.
 *                     @arg RTC_TAMPER_2 : Select Tamper 2.
 *
 * @param     trigger: Specifies the trigger on the tamper pin that stimulates tamper event.
 *                     This parameter can be one of the following values:
 *                     @arg RTC_TAMPER_TRIGGER_EDGE_RISING  : Rising Edge of the tamper pin causes tamper event.
 *                     @arg RTC_TAMPER_TRIGGER_EDGE_FALLING : Falling Edge of the tamper pin causes tamper event.
 *                     @arg RTC_TAMPER_TRIGGER_LEVEL_LOW    : Low Level of the tamper pin causes tamper event.
 *                     @arg RTC_TAMPER_TRIGGER_LEVEL_HIGH   : High Level of the tamper pin causes tamper event.
 *
 * @retval    None
 */
void RTC_ConfigTamperTrigger(RTC_TAMPER_T tamper, RTC_TAMPER_TRIGGER_T trigger)
{
    if (tamper == RTC_TAMPER_1)
    {
        RTC->TACFG_B.TP1ALCFG = trigger;
    }
    else
    {
        RTC->TACFG_B.TP2ALCFG = trigger;
    }
}

/*!
 * @brief     Enables the Tamper detection
 *
 * @param     tamper: Selected tamper pin.
 *                    This parameter can be one of the following values:
 *                    @arg RTC_TAMPER_1 : Select Tamper 1.
 *                    @arg RTC_TAMPER_2 : Select Tamper 2.
 *
 * @retval    None
 */
void RTC_EnableTamper(RTC_TAMPER_T tamper)
{
    if (tamper == RTC_TAMPER_1)
    {
        RTC->TACFG_B.TP1EN = BIT_SET;
    }
    else
    {
        RTC->TACFG_B.TP2EN = BIT_SET;
    }
}

/*!
 * @brief     Disables the Tamper detection
 *
 * @param     tamper: Selected tamper pin.
 *                    This parameter can be any combination of the following values:
 *                    @arg RTC_TAMPER_1 : Select Tamper 1.
 *                    @arg RTC_TAMPER_2 : Select Tamper 2.
 *
 * @retval    None
 */
void RTC_DisableTamper(RTC_TAMPER_T tamper)
{
    if (tamper == RTC_TAMPER_1)
    {
        RTC->TACFG_B.TP1EN = BIT_RESET;
    }
    else
    {
        RTC->TACFG_B.TP2EN = BIT_RESET;
    }
}

/*!
 * @brief     Config the Tampers Filter
 *
 * @param    filter: Specifies the tampers filter.
 *                   This parameter can be one of the following values:
 *                   @arg RTC_TAMPER_FILTER_DISABLE : Tamper filter is disabled.
 *                   @arg RTC_TAMPER_FILTER_2SAMPLE : Tamper is activated after 2 consecutive samples at the active level
 *                   @arg RTC_TAMPER_FILTER_4SAMPLE : Tamper is activated after 4 consecutive samples at the active level
 *                   @arg RTC_TAMPER_FILTER_8SAMPLE : Tamper is activated after 8 consecutive samples at the active level
 *
 * @retval    None
 */
void RTC_ConfigFilter(RTC_TAMPER_FILTER_T filter)
{
    RTC->TACFG_B.TPFCSEL = filter;

