RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rtc.c
}

/*!
 * @brief     Config the Tampers Sampling Frequency
 *
 * @param     freq: Specifies the tampers Sampling Frequency.
 *                  This parameter can be one of the following values:
 *                  @arg RTC_TSF_DIV_32768 : Tampers Sampling Frequency = RTC_CLK/32768
 *                  @arg RTC_TSF_DIV_16384 : Tampers Sampling Frequency = RTC_CLK/16384
 *                  @arg RTC_TSF_DIV_8192  : Tampers Sampling Frequency = RTC_CLK/8192
 *                  @arg RTC_TSF_DIV_4096  : Tampers Sampling Frequency = RTC_CLK/4096
 *                  @arg RTC_TSF_DIV_2048  : Tampers Sampling Frequency = RTC_CLK/2048
 *                  @arg RTC_TSF_DIV_1024  : Tampers Sampling Frequency = RTC_CLK/1024
 *                  @arg RTC_TSF_DIV_512   : Tampers Sampling Frequency = RTC_CLK/512
 *                  @arg RTC_TSF_DIV_256   : Tampers Sampling Frequency = RTC_CLK/256
 *
 * @retval    None
 */
void RTC_ConfigSamplingFreq(RTC_TSF_DIV_T freq)
{
    RTC->TACFG_B.TPSFSEL = freq;
}

/*!
 * @brief     Config the Precharge Duration.
 *
 * @param     duration: Specifies the Tampers Pins input  Precharge Duration.
 *                  This parameter can be one of the following values:
 *                  @arg RTC_TPD_RTCCLK_1 : Tamper pins are pre-charged before sampling during 1 RTCCLK cycle.
 *                  @arg RTC_TPD_RTCCLK_2 : Tamper pins are pre-charged before sampling during 2 RTCCLK cycle.
 *                  @arg RTC_TPD_RTCCLK_4 : Tamper pins are pre-charged before sampling during 4 RTCCLK cycle.
 *                  @arg RTC_TPD_RTCCLK_8 : Tamper pins are pre-charged before sampling during 8 RTCCLK cycle.
 *
 * @retval    None
 */
void RTC_PinsPrechargeDuration(RTC_TPD_RTCCLK_T duration)
{
    RTC->TACFG_B.TPPRDUSEL = duration;
}

/*!
 * @brief     Enables the TimeStamp on Tamper Detection Event
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_EnableTDE(void)
{
    RTC->TACFG_B.TPTSEN = BIT_SET;
}

/*!
 * @brief     Disable the TimeStamp on Tamper Detection Event
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_DisableTDE(void)
{
    RTC->TACFG_B.TPTSEN = BIT_RESET;
}

/*!
 * @brief     Enable pull-up resistors to precharge of the selected Tamper pin.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_EnablePullUp(void)
{
    /* Enable precharge */
    RTC->TACFG_B.TPPUDIS = BIT_RESET;
}

/*!
 * @brief     Disable pull-up resistors to precharge of the selected Tamper pin.
 *
 * @param     None
 *
 * @retval    None
 */
void RTC_DisablePullUp(void)
{
    /* Disable precharge */
    RTC->TACFG_B.TPPUDIS = BIT_SET;
}

/*!
 * @brief     Writes a data in RTC Backup data.
 *
 * @param     backup: RTC Backup data Register number.
 *                    This parameter can be RTC_BAKP_REG_x where x can be from 0 to 19.
 *
 * @param     data: Data to be written in the specified RTC Backup data register.
 *
 * @retval    None
 */
void RTC_WriteBackup(RTC_BAKP_REG_T backupReg, uint32_t data)
{
    RTC->BAKP[backupReg] = (uint32_t)data;
}

/*!
 * @brief     Reads a data in RTC Backup data.
 *
 * @param     backup: RTC Backup data Register number.
 *                    This parameter can be RTC_BAKP_REG_x where x can be from 0 to 19.
 *
 * @retval    None
 */
uint32_t RTC_ReadBackup(RTC_BAKP_REG_T backupReg)
{
    return RTC->BAKP[backupReg];
}

/*!
 * @brief     Config Tamper Pin.
 *
 * @param     tamperPin: specifies the RTC Tamper Pin.
 *                       This parameter can be one of the following values:
 *                       @arg RTC_TAMPER_PIN_AF1 : RTC_AF1(PC13) is used as RTC Tamper Pin.
 *                       @arg RTC_TAMPER_PIN_AF2 : RTC_AF2(PI8) is used as RTC Tamper Pin.
 *
 * @retval    None
 */
void RTC_ConfigTamperPin(RTC_TAMPER_PIN_T tamperPin)
{
    RTC->TACFG_B.TP1MSEL = tamperPin;
}

/*!
 * @brief     Config the RTC TimeStamp Pin.
 *
 * @param     timeStampPin: specifies the RTC TimeStamp Pin.
 *                          This parameter can be one of the following values:
 *                          @arg RTC_TIMESTAMP_PIN_AF1 : RTC_AF1(PC13) is used as RTC TimeStamp Pin.
 *                          @arg RTC_TIMESTAMP_PIN_AF2 : RTC_AF2(PI8) is used as RTC TimeStamp Pin.
 *
 * @retval    None
 */
void RTC_ConfigTimeStampPin(RTC_TIMESTAMP_PIN_T timeStampPin)
{
    RTC->TACFG_B.TSMSEL = timeStampPin;
}

/*!
 * @brief     Config the RTC Output Pin mode
 *
 * @param     outputType: specifies the RTC Output (PC13) pin mode.
 *                        This parameter can be one of the following values:
 *                        @arg RTC_OUTPUT_OD : RTC_ALARM(PC13) output Open-drain
 *                        @arg RTC_OUTPUT_PP : RTC_ALARM(PC13) output Push-pull
 *
 * @retval    None
 */
void RTC_ConfigOutputType(RTC_OUTPUT_T outputType)
{
    RTC->TACFG_B.ALRMOT = outputType;
}

/*!
 * @brief     Config the Synchronization Shift Control Settings.
 *
 * @param     add1S:  Select to add or not 1 second to the time Calendar.
 *                    This parameter can be one of the following values :
 *                    @arg RTC_SHIFT_ADD1S_RESET: No effect.
 *                    @arg RTC_SHIFT_ADD1S_SET  : Add one second to the clock calendar.
 *
 * @param     subFS:  Select the number of Second Fractions to Substitute.
 *                    This parameter can be one any value from 0 to 0x7FFF.
 *
 * @retval    SUCCESS or ERROR
 */
uint8_t RTC_ConfigSynchroShift(RTC_SHIFT_ADD1S_T add1S, uint16_t subFS)
{
    uint32_t timeout = 0;

    RTC_DisableWriteProtection();

    /* wait for Shift operation flag to be cleared */
    while ((RTC->STS_B.SOPFLG != BIT_RESET) && (timeout != RTC_TIMEOUT_SHIFT))
    {
        timeout++;
    }

    /* check if Shift Operation flag is cleared and Reference Clock Detection is disabled */
    if ((RTC->STS_B.SOPFLG != BIT_SET) && (RTC->CTRL_B.RCLKDEN != BIT_SET))
    {
        RTC->SHIFT = ((uint32_t)add1S << 31) | (uint32_t)subFS;

        if (RTC_WaitForSynchro() != ERROR)
        {
            RTC_EnableWriteProtection();

            return SUCCESS;
        }
    }

    RTC_EnableWriteProtection();

