RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_rtc.c
    return ERROR;
}

/*!
 * @brief     Enable RTC interrupts.
 *
 * @param     interrupt: specifies the RTC interrupt sources to be enabled
 *                     This parameter can be any combination of the following values:
 *                      @arg RTC_INT_ALRA : Enable ALRMA A interrupt
 *                      @arg RTC_INT_ALRB : Enable ALRMA B interrupt
 *                      @arg RTC_INT_WT   : Enable WakeUp Timer interrupt
 *                      @arg RTC_INT_TS   : Enable Time Stamp interrupt
 *                      @arg RTC_INT_TAMP : Enable Tamper event interrupt
 *
 * @retval    None
 */
void RTC_EnableInterrupt(uint32_t interrupt)
{
    RTC_DisableWriteProtection();

    RTC->CTRL |= (uint32_t)(interrupt & ~RTC_INT_TAMP);
    RTC->TACFG |= (uint32_t)(interrupt & RTC_INT_TAMP);

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Disable RTC interrupts.
 *
 * @param     interrupt: specifies the RTC interrupt sources to be disable
 *                       This parameter can be any combination of the following values:
 *                        @arg RTC_INT_ALRA : Disable ALRMA A interrupt
 *                        @arg RTC_INT_ALRB : Disable ALRMA B interrupt
 *                        @arg RTC_INT_WT   : Disable WakeUp Timer interrupt
 *                        @arg RTC_INT_TS   : Disable Time Stamp interrupt
 *                        @arg RTC_INT_TAMP : Disable Tamper event interrupt
 *
 * @retval    None
 */
void RTC_DisableInterrupt(uint32_t interrupt)
{
    RTC_DisableWriteProtection();

    RTC->CTRL &= (uint32_t)~(interrupt & ~RTC_INT_TAMP);
    RTC->TACFG &= (uint32_t)~(interrupt & RTC_INT_TAMP);

    RTC_EnableWriteProtection();
}

/*!
 * @brief     Read the specified RTC flag.
 *
 * @param     flag: specifies the flag to check.
 *                  This parameter can be one of the following values:
 *                  @arg RTC_FLAG_AAWF : Alarm A Write Flag
 *                  @arg RTC_FLAG_ABWF : Alarm B Write Flag
 *                  @arg RTC_FLAG_WTWF : Wakeup Timer Write Flag
 *                  @arg RTC_FLAG_SOPF : Shift Operation Pending Flag
 *                  @arg RTC_FLAG_ISF  : Initialization State Flag
 *                  @arg RTC_FLAG_RSF  : Registers Synchronization Flag
 *                  @arg RTC_FLAG_INTF : Register Initialization Flag
 *                  @arg RTC_FLAG_ALRAF: Alarm A Match Flag
 *                  @arg RTC_FLAG_ALRBF: Alarm B Match Flag
 *                  @arg RTC_FLAG_WTF  : Wakeup Timer Flag
 *                  @arg RTC_FLAG_TSF  : Time Stamp Flag
 *                  @arg RTC_FLAG_TSOF : Time Stamp Overflow Flag
 *                  @arg RTC_FLAG_TP1F : Tamper 1 event Detection Flag
 *                  @arg RTC_FLAG_TP2F : Tamper 2 event Detection Flag
 *                  @arg RTC_FLAG_RPF  : Recalibration Pending Flag
 *
 * @retval    SET or RESET.
 */
uint8_t RTC_ReadStatusFlag(RTC_FLAG_T flag)
{
    return (RTC->STS & flag) ? SET : RESET;
}

/*!
 * @brief     Clears the RTC's status flags.
 * @param     flag: specifies the RTC flag to clear.
 *                  This parameter can be any combination of the following values:
 *                  @arg RTC_FLAG_RSF   : Registers Synchronization Flag
 *                  @arg RTC_FLAG_ALRAF : Alarm A Match Flag
 *                  @arg RTC_FLAG_ALRBF : Alarm B Match Flag
 *                  @arg RTC_FLAG_WTF   : Wakeup Timer Flag
 *                  @arg RTC_FLAG_TSF   : Time Stamp Flag
 *                  @arg RTC_FLAG_TSOF  : Time Stamp Overflow Flag
 *                  @arg RTC_FLAG_TP1F  : Tamper 1 event Detection Flag
 *                  @arg RTC_FLAG_TP2F  : Tamper 2 event Detection Flag
 */
void RTC_ClearStatusFlag(uint32_t flag)
{
    RTC->STS &= (uint32_t)~flag;
}

/*!
 * @brief     Read interrupt flag bit is set
 *
 * @param     flag: specifies the flag to read.
 *                  This parameter can be one of the following values:
 *                  @arg RTC_INT_FLAG_ALRA  : Alarm A interrupt
 *                  @arg RTC_INT_FLAG_ALRB  : Alarm B interrupt
 *                  @arg RTC_INT_FLAG_WT    : WakeUp Timer interrupt
 *                  @arg RTC_INT_FLAG_TS    : Time Stamp interrupt
 *                  @arg RTC_INT_FLAG_TAMP1 : Tamper1 event interrupt
 *                  @arg RTC_INT_FLAG_TAMP2 : Tamper2 event interrupt
 *
 * @retval    The new state of flag (SET or RESET).
 */
uint8_t RTC_ReadIntFlag(RTC_INT_FLAG_T flag)
{
    uint8_t intEnable;
    uint32_t intStatus;

    if (flag & 0x01)
    {
        intEnable = RTC->TACFG_B.TPIEN;
        intStatus = (uint32_t)(RTC->STS & (flag >> 4));
    }
    else
    {
        intEnable = (RTC->CTRL & flag) ? SET : RESET;
        intStatus = (uint32_t)(RTC->STS & (flag >> 4));
    }

    if (intEnable && intStatus)
    {
        return SET;
    }

    return RESET;
}

/*!
 * @brief     Clear RTC interrupt flag bit
 *
 * @param     flag: specifies the flag to clear.
 *                  This parameter can be any combination the following values:
 *                  @arg RTC_INT_FLAG_ALRA  : ALRMA interrupt
 *                  @arg RTC_INT_FLAG_ALRB  : ALRMB interrupt
 *                  @arg RTC_INT_FLAG_TS    : Time Stamp interrupt
 *                  @arg RTC_INT_FLAG_WT    : WakeUp Timer interrupt
 *                  @arg RTC_INT_FLAG_TAMP1 : Tamper1 event interrupt
 *                  @arg RTC_INT_FLAG_TAMP2 : Tamper2 event interrupt
 *
 * @retval    SET or RESET
 */
void RTC_ClearIntFlag(uint32_t flag)
{
    RTC->STS &= (uint32_t) ~(flag >> 4);
}

/*!
 * @brief     Converts a 2 digit decimal to BCD format
 *
 * @param     val: Byte to be converted
 *
 * @retval    Converted byte
 */
static uint8_t RTC_ByteConBcd2(uint8_t val)
{
    uint8_t bcdhigh = 0;

    while (val >= 10)
    {
        bcdhigh++;
        val -= 10;
    }

    return ((uint8_t)(bcdhigh << 4) | val);
}

/*!
 * @brief     Convert from 2 digit BCD to Binary
 *
 * @param     val: BCD value to be converted
 *
 * @retval    Converted word
 */
static uint8_t RTC_Bcd2ConByte(uint8_t val)
{
    uint8_t tmp = 0;
    tmp = ((uint8_t)(val & (uint8_t)0xF0) >> (uint8_t)0x4) * 10;
    return (tmp + (val & (uint8_t)0x0F));
}

/**@} end of group RTC_Functions */
/**@} end of group RTC_Driver */
/**@} end of group APM32F4xx_StdPeriphDriver */
